---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFC.SetOwnerHistoryHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle)
source: html/dbdb1fba-2cbb-1c18-56b8-f6f35bde1f3f.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFC.SetOwnerHistoryHandle Method

Sets the handle to the IfcOwnerHistory for the file.

## Syntax (C#)
```csharp
public void SetOwnerHistoryHandle(
	IFCAnyHandle ownerHistory
)
```

## Parameters
- **ownerHistory** (`Autodesk.Revit.DB.IFC.IFCAnyHandle`) - The handle.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null